/*
*



             ┌──────────────┐
             │              │
             │  let soKWh = 450;
             │  let s = 0;  │
             │              │
             └─────┬────────┘
                   │
                   │soKWh <= 50
                   ├───────────────►   s = soKWh * 1678;
                   │
                   │
                   │ soKWh <= 100
                   ├───────────────►  s = 50 * 1678 + (soKWh - 50) * 1734;
                   │
                   │
                   │soKWh <= 200
                   ├──────────────►  s = 50 * 1678 + 50 * 1734 + (soKWh - 100) * 2014;
                   │
                   │
                   │soKWh <= 300
                   ├──────────────►   s = 50 * 1678 + 50 * 1734 + 100 * 2014 + (soKWh - 200) * 2536;
                   │
                   │
                   │soKWh <= 400
                   ├──────────────►    s = 50 * 1678 + 50 * 1734 + 100 * 2014 + 100 * 2536 + (soKWh - 300) * 2834;
                   │
                   │
                   │soKWh >400
                   └──────────────►  s = 50 * 1678 + 50 * 1734 + 100 * 2014 + 100 * 2536 + 100 * 2834 + (soKWh - 400) * 2927;
                   * ta dùng caau lệnh if -else để check giá trị khi giá trị thích hop sẽ ra số tiền tương úng

                                                                                                                                         */
let soKWh = 50;
let s = 0;

if (soKWh <= 50) {
    s = soKWh * 1678;
} else if (soKWh <= 100) {
    s = 50 * 1678 + (soKWh - 50) * 1734;
} else if (soKWh <= 200) {
    s = 50 * 1678 + 50 * 1734 + (soKWh - 100) * 2014;
} else if (soKWh <= 300) {
    s = 50 * 1678 + 50 * 1734 + 100 * 2014 + (soKWh - 200) * 2536;
} else if (soKWh <= 400) {
    s = 50 * 1678 + 50 * 1734 + 100 * 2014 + 100 * 2536 + (soKWh - 300) * 2834;
} else {
    s = 50 * 1678 + 50 * 1734 + 100 * 2014 + 100 * 2536 + 100 * 2834 + (soKWh - 400) * 2927;
}
console.log("Số kWh:", soKWh);
console.log("Tiền điện:", s.toLocaleString() + " đồng");